{
  "drain": {
    "loading": {
      "title": "Calculating Drain & Transfer Vectors..."
    },
    "accessRestricted": "Access Restricted",
    "missingTests": {
      "title": "Complete all tests first",
      "subtitle": "Drain analysis needs your Imposed, Surface, and Innate persona results.",
      "imposed": "Imposed Test",
      "surface": "Surface Test",
      "innate": "Innate Test"
    },
    "errors": {
      "unavailableTitle": "Unable to load report",
      "unavailableBody": "Please refresh and try again."
    },
    "status": {
      "cached": "Derived data loaded from database",
      "recomputed": "Derived data recalculated",
      "upsertFailed": "Derived data saved locally (sync pending)",
      "upsertDetailFallback": "database not responding"
    },
    "header": {
      "titleStart": "Energy Drain",
      "titleAccent": "&",
      "titleEnd": "Adaptation",
      "subtitle": "Drain = leakage. Adaptation = effective transfer.",
      "instrumentationCta": "View Instrumentation"
    },
    "overview": {
      "title": "Overview",
      "howToRead": "How to read this (criteria)",
      "criteria": {
        "ranked": "Drives are ranked by {strong} (what you actually spend effort on).",
        "drain": "Significant drain: {value}.",
        "transfer": "Significant adaptation/transfer: {value}.",
        "pathsTitle": "Path display rules:",
        "drainPath": "Drain paths: show only if {value}.",
        "transferPath": "Transfer paths: show only if {value}.",
        "bars": "Bars: now computed from fit-core aggregates (surfaceDrain/surfaceTransfer), scaled from 0..5 to 0..100%."
      },
      "drainChart": {
        "title": "Energy Drain (Red)",
        "subtitle": "Inner Conflicts",
        "range": "0–100%"
      },
      "transferChart": {
        "title": "Energy Adaptation (Green)",
        "subtitle": "Effective Instrumentation",
        "range": "0–100%"
      },
      "summary": {
        "totalDrain": "Total Drain",
        "totalTransfer": "Total Adaptation",
        "drivesOver": "Drives > {value}: {count}",
        "topSignals": "Top Signals",
        "topDrain": "Drain",
        "topTransfer": "Adaptation"
      }
    },
    "sections": {
      "drainTitle": "Drained drives (surfaceDrain > {value})",
      "drainEmpty": "No drives exceeded the drain threshold ({value}).",
      "transferTitle": "Adapted drives (surfaceTransfer > {value})",
      "transferEmpty": "No drives exceeded the transfer threshold ({value}).",
      "restTitle": "Remaining drives"
    },
    "card": {
      "surfaceEnergy": "Surface energy",
      "drainDetected": "DRAIN DETECTED",
      "transferDetected": "ADAPTATION DETECTED",
      "noSignal": "NO MAJOR SIGNAL",
      "drainedEnergy": "Drained energy",
      "transferredEnergy": "Transferred energy",
      "pctOfSurface": "{pct}% of surface",
      "drainPaths": "Drain paths (lr > 0)",
      "noDrainPaths": "No drain paths (lr > 0) for this drive.",
      "targetDrive": "Target drive",
      "drainContribution": "Drain contribution",
      "adjustmentTitle": "Adjustment strategy",
      "adjustmentFallback": "{drive} is compensating for {target}. Try satisfying {targetLower} more directly in environments that support it.",
      "transferPaths": "Transfer / adaptation paths (1 - lr > {min})",
      "noTransferPaths": "No transfer paths with (1 - lr) > {min}.",
      "innateSource": "Innate Source Drive",
      "transferContribution": "Transfer contribution",
      "adaptationTitle": "Successful adaptation note",
      "adaptationFallback": "This suggests your current {driveLower} behavior supports {targetLower} with minimal leakage in the current environment.",
      "restNote": "This drive does not currently show significant drain or significant adaptation/transfer above the thresholds."
    },
    "integration": {
      "title": "Integration Summary",
      "drainTableTitle": "Drain paths shown (lr > 0)",
      "transferTableTitle": "Transfer paths shown (lr == 0)",
      "table": {
        "surfaceDrive": "Surface Drive",
        "innateDrive": "Innate Drive",
        "drainContribution": "Drain Contribution",
        "diversion": "Diversion (dr)",
        "noDrain": "No drain paths (lr > 0).",
        "noTransfer": "No transfer paths (lr == 0)."
      },
      "footer": "Drain + adaptation computation complete.",
      "dashboard": "Dashboard"
    },
    "nextStep": {
      "title": "Next Step",
      "body": "This report reflects your current energy draining and adaptation patterns. The advice is for reference only and is not medical diagnostic advice. If you feel strong inner conflicts or other issues, please consult a medical professional. After you make adjustments, you can come back and retake the test, as these patterns can change over time."
    },
    "advice": {
      "Exploration": {
        "Achievement": "You may be investing a lot of energy in exploring new ideas and possibilities with the hope that the right insight will finally unlock the progress and achievement you care about. In this pattern, exploration can feel productive without requiring the constraints that achievement demands—deadlines, narrowing scope, and tolerating imperfect execution. The strain arises when curiosity keeps expanding but your “achievement meter” still doesn’t move, so exploration starts to feel more like busywork than growth. A reassuring balance is to keep exploration, while routinely converting it into one concrete deliverable at a time—a prototype, draft, submission, demo, or measurable milestone. That way, exploration becomes the fuel for achievement rather than a detour around it.",
        "Dominance": "You may explore new ideas partly to gain a sense of control—believing that the person with the most compelling idea gets to shape the direction and call the shots. This can quietly turn exploration into a leadership strategy: collecting novelty to justify authority. The strain shows up when reality stays unpredictable even with great ideas, leaving you anxious and still not truly “in charge.” A healthier approach is to separate insight from control: use exploration to identify a few levers you can actually influence, then take small decisive actions within that scope. This turns exploration from status-seeking into a grounded sense of authority over your own choices.",
        "Pleasure": "You may chase novelty and stimulation to compensate for difficulty accessing genuine pleasure or rest. When pleasure feels unavailable, exploration can become a substitute—new topics, new plans, new rabbit holes—so you don’t have to sit with boredom, emptiness, or fatigue. The strain is that novelty eventually stops restoring you and begins to feel like restlessness you can’t turn off. A supportive balance is to introduce intentional pleasure—sensory comfort, play, recovery, unstructured downtime—that doesn’t have to be earned through constant discovery. When pleasure is treated as legitimate, exploration becomes joyful again rather than compulsive.",
        "Care": "You may pour energy into understanding people, psychology, or relationship dynamics in hopes that insight will compensate for unmet needs in intimacy—whether with a partner or close family. This can create “over-analysis caregiving,” where thinking replaces direct emotional contact and repair. The strain appears when you feel you’ve “figured everything out,” yet the relationship still lacks warmth, security, or reciprocity. A better balance is to reduce interpretation and increase simple care behaviors: consistency, reassurance, listening, and direct acts of support. Care is often satisfied more by presence and reliability than by explanation.",
        "Affiliation": "You may pursue new experiences and ideas as a route to belonging—hoping that being interesting, informed, or adventurous will naturally create social connection. In this pattern, exploration becomes social currency: “If I keep bringing novelty, I’ll stay included.” The strain is that affiliation remains thin, because closeness depends more on repetition, trust, and mutual investment than on novelty. A balanced approach is to keep exploration, but also build rituals of belonging: regular contact, shared commitments, and showing up even when you have nothing new to offer. Then affiliation becomes stable and safe, not something you have to perform.",
        "Value": "You may hold a value system where being inventive and explorative feels like a treasured trait—believing that being a “cool innovator” will meet the expectations of society or family. When constant searching doesn’t translate into outcomes that satisfy your internal standard, you may start to devalue yourself, as if exploration only counts when it produces a discovery. The strain is that your sense of worth becomes dependent on exceptional originality, which is an exhausting bar to live under. A healthier balance is to re-evaluate whether you must make new discoveries to be valuable and to widen your definition of contribution. Many forms of impact—mentorship, craftsmanship, service, steady improvement, and relational support—are also meaningful and worthy."
      },
      "Achievement": {
        "Exploration": "You may pursue goals and output as a way to “earn” the right to explore—treating curiosity like a reward instead of a basic psychological nutrient. This can keep you in performance mode even when learning, novelty, and play would actually restore your motivation and clarity. The strain often shows up as burnout or dullness: you keep on trying to achieve goals, yet you feel mentally flat and less inspired over time. A supportive balance is to treat exploration as an input to achievement. Protect time for learning, experimentation, and open-ended curiosity. When exploration is scheduled proactively, achievement becomes more creative, sustainable, and less brittle.",
        "Dominance": "You may chase achievement to compensate for feeling powerless—believing that success will secure respect, influence, or safety. This can create a pressure loop: the more control you want, the more you over-invest in outcomes and feel like you can’t afford to slow down. The strain is that achievement rarely produces lasting dominance; it offers temporary wins, but the underlying uncertainty can remain. A healthier approach is to build direct agency alongside your goals: clarify authority, negotiate boundaries, and choose arenas where you truly have leverage. That way your sense of control comes from structure and positioning, not only from results.",
        "Pleasure": "You may invest heavily in achievement hoping it will eventually unlock peace, joy, or permission to rest. But when pleasure is postponed until after success, it often stays out of reach—because there is always another milestone. The strain can look like anhedonia: you accomplish something and still feel tense, empty, or unable to fully enjoy it. A kinder strategy is to integrate pleasure into the achievement process—micro-rewards, recovery cycles, and enjoyment of mastery and progress, not only the finish line. Then pleasure supports performance as maintenance, rather than becoming something you must endlessly “deserve.”",
        "Care": "You may strive to provide, protect, or stabilize loved ones—using achievement to secure resources and reduce uncertainty for the people you care about. In this pattern, care can start to feel tied to performance: “If I succeed, everyone will be okay.” The strain arises when relational safety still feels shaky despite your effort, which can push you into carrying more than your share. A healthier balance is to separate care from over-functioning: keep contributing, but also invite shared responsibility, direct communication, and emotional reciprocity. Care isn’t only what you deliver—it’s also what the relationship can hold with you.",
        "Affiliation": "You may use achievement as a pathway to belonging—hoping success will bring approval, admiration, or inclusion. This can make connection feel conditional: you feel closer when you’re “winning” and more anxious when you’re not. The strain often shows up as social insecurity or impostor feelings, where relationships feel fragile because they depend on performance. A steadier balance is to pursue affiliation directly through shared time, mutual support, and selective vulnerability—ways of being known beyond your results. Achievement can complement belonging, but it can’t replace the felt safety of being accepted as a whole person.",
        "Value": "You may treat achievement as moral validation—believing that being productive or excellent proves you are worthy and “good.” When outcomes don’t deliver that inner confirmation, the strain can feel personal and heavy, as if a missed goal means you failed as a person. This often intensifies when goals don’t match your genuine interests, your real strengths, or the environment you’re in. A healthier approach is to define “valuable goals” using your internal compass—your genuine interest, competence, and environmental support—while separating dignity from output. Then achievement can serve your values without becoming your identity or your scoreboard of worth."
      },
      "Dominance": {
        "Exploration": "You may push for control first so you feel safe enough to explore later—treating uncertainty as something you must neutralize before curiosity is allowed. This can quietly trap you in “management mode,” where you keep stabilizing the environment but never feel free enough to experiment. The strain shows up as rigidity and mental narrowing; exploration starts to feel risky instead of energizing, so you postpone it again and again. A healthier balance is to create bounded exploration: small experiments with clear limits, low stakes, and defined time windows. This lets curiosity return without requiring total control, and it often builds confidence that uncertainty can be handled rather than eliminated.",
        "Achievement": "You may rely on force, urgency, or pressure on others (or yourself) to support performance—using dominance as a motivational engine. It can work in the short term, especially when you need quick movement, but it often becomes draining because you have to keep escalating intensity to maintain momentum. The strain can show up as conflict, fatigue, or a sense that life is always a contest where you must “push” to get outcomes. A more sustainable path is to replace force with systems—routines, feedback loops, clear scope, and predictable milestones. When achievement is supported by structure instead of sheer intensity, progress becomes steadier and you don’t have to live in constant pressure.",
        "Pleasure": "You may pursue dominance to access pleasure—treating winning, control, or being “on top” as a substitute for relaxation and joy. The hope is that once things are under your command, you’ll finally feel free, but often the opposite happens: control keeps your nervous system vigilant. The strain is that pleasure stays shallow or rare, because your body remains in command mode even when you “have time.” A helpful balance is to practice pleasure that is explicitly non-competitive and non-instrumental—rest, play, softness, sensory comfort, or quiet enjoyment that doesn’t prove anything. Pleasure becomes more available when it doesn’t require dominance to justify it.",
        "Care": "You may take charge in relationships to protect people or prevent chaos, hoping control will compensate for care anxiety. Over time, this can turn care into management—helping, fixing, advising, steering—rather than emotional attunement. The strain often appears as resentment (“I’m carrying everyone”) or disconnection (“I’m close, but not emotionally met”), because control can’t substitute for mutual warmth and responsiveness. A healthier approach is care with consent and collaboration: ask what support is wanted, share responsibility, and allow others their autonomy. Care is often satisfied most deeply through trust and partnership—not only through control.",
        "Affiliation": "You may seek status or authority to secure belonging—assuming that if you’re important, you won’t be excluded. That can create relationships that feel transactional, where affiliation depends on role, usefulness, or rank rather than genuine closeness. The strain is “loneliness at the top”: you may be surrounded by people yet still feel unseen or unsupported. A steadier balance is to invest in horizontal bonds—friendship, shared identity, reciprocity, and moments of mutual vulnerability. Affiliation becomes more stable when you don’t have to perform dominance to keep your place.",
        "Value": "You may enforce rules or certainty to feel morally aligned—using dominance to make the world match what you believe is right. The strain shows up when reality resists: you can’t fully control others’ choices, so frustration builds and the system feels perpetually “not corrected enough.” This can harden into rigidity or constant judgment, which is exhausting and often isolates you from nuance and connection. A healthier approach is to focus on high-leverage principles and influence through modeling, persuasion, and boundaries rather than force. Values become more sustainable when you can practice them consistently without needing total compliance from the world."
      },
      "Pleasure": {
        "Exploration": "You may reach for quick stimulation when curiosity feels blocked—using pleasure as a retreat from frustrations around exploration. The tricky part is that too much stimulation can actually make real exploration harder by fragmenting attention and lowering tolerance for slow, effortful learning. The strain can become a restless loop: you keep sampling novelty, but rarely get the depth that truly satisfies curiosity. A more supportive balance is to reduce noise and create low-stimulation exploration—slow reading, long walks, reflective learning, or hands-on tinkering without pressure. When pleasure becomes calmer and more regulating, exploration tends to feel more meaningful and rewarding again.",
        "Achievement": "You may lean on mood and rewards to get yourself moving—using pleasure as a motivational hack to push productivity. When structure or competence isn’t in place, rewards don’t reliably translate into progress, and that can leave you feeling guilty or stuck. The strain can sound like: “I need to feel good to work, but I need to work to feel good.” A healthier approach is to build minimum-viable routines—small daily actions that happen regardless of mood, so progress is steady and predictable. Then pleasure becomes reinforcement after effort, not the engine that effort depends on.",
        "Dominance": "You may use indulgence as an escape when you feel frustrated about control, influence, or direction—turning pleasure into relief from the stress of not being able to steer things. This can create an uncomfortable cycle of escape and regret, where the underlying need for direction remains unresolved. A steadier balance is to separate the two: protect genuine time for relaxation, while also reserving focused time to rebuild a sense of control where it’s actually possible. That might look like learning group dynamics, doing background research, or preparing better—so you can steer the parts of your environment that can be influenced. Pleasure then becomes restorative, while dominance becomes more grounded and less reactive.",
        "Care": "You may use comfort to compensate for strain in intimate relationships—soothing yourself or others when deeper emotional needs aren’t being met. The strain is that pleasure becomes a band-aid and an escape: it can reduce discomfort short-term, but it doesn’t reliably create bonding, consistency, or intimacy. A balanced strategy is to pair pleasure with relational care behaviors—checking in, showing up consistently, offering direct support, and having repair conversations when needed. Then pleasure supports care instead of replacing it, and closeness becomes more stable over time.",
        "Affiliation": "You may seek fun social experiences to compensate for loneliness. If what you truly need is deeper affiliation—acceptance, loyalty, being known—then “fun” can sometimes leave you emptier afterward. The strain becomes social fatigue without real closeness. A healthier approach is to shift from event-based connection to relationship-based connection: recurring contact with fewer people, more depth, and more honest sharing. Pleasure becomes a bonus that enriches belonging, rather than the main route you have to rely on.",
        "Value": "You may use pleasure as an escape from feelings of worthlessness, or to quiet inner “shoulds” and moral pressure. If your value system is rigid, pleasure can carry guilt, which prevents it from restoring you the way it’s meant to. The strain often looks like oscillation between discipline and indulgence. A better balance is to update your values to include rest as responsible and pleasure as maintenance—not moral failure. When values become kinder, pleasure becomes cleaner, and you get both relief and integrity at the same time."
      },
      "Care": {
        "Exploration": "You may invest deeply in caring for others, hoping the relationship will also bring you learning, novelty, or a sense of growth—perhaps through admiration of your partner’s exploratory strengths, or as comfort after frustrating exploration experiences. Still, your need for exploration is personal and can’t be fully fulfilled through someone else, even someone you love. When the relationship becomes consuming, your curiosity may quietly fade, and you can start to feel mentally boxed in or stagnant. The strain is that care becomes the whole identity, while curiosity begins to feel selfish or unsafe to pursue. A healthier balance is to protect personal exploration time as part of being a good caregiver, not in conflict with it—when your mind is nourished, your care becomes more generous, steady, and less vulnerable to resentment.",
        "Achievement": "You may pour a lot of energy into building and supporting intimate relationships, hoping closeness will soothe frustration around achievement and progress. Yet relationships can’t replace the specific satisfaction that comes from competence, mastery, and finishing goals—so the underlying achievement tension can remain. The strain often shows up as over-investing in caretaking while feeling quietly disappointed about your own forward motion. A balanced approach is to keep care as a strength, while also reserving protected time for direct achievement practices: clear goals, small wins, and environments that reward progress. When achievement is addressed directly, care no longer has to “carry” what achievement is meant to resolve. Then your relationships become a supportive base, not a substitute.",
        "Dominance": "You may care in a way that tries to prevent harm by controlling outcomes—helping, fixing, managing, advising, and steering. This often comes from a protective instinct and the worry that “If I don’t guide this, something will go wrong.” The strain is that care becomes heavy: you get exhausted, and resentment can build, especially if others feel managed rather than supported. Over time, this can also create relational distance, because control reduces the sense of mutual trust. A healthier balance is to shift from control-care to choice-care: offer support, ask permission, and allow others to own their decisions and consequences. When care doesn’t require dominance, it becomes lighter, more respectful, and more sustainable.",
        "Pleasure": "You may give care hoping it will create warmth, peace, or emotional safety that also makes up for your own unmet pleasure needs. If others don’t reciprocate—or if the relationship stays stressful—you can end up deprived on both fronts. The strain is a quiet depletion: you keep supporting loved ones, yet the care may feel overwhelming to them, and the warmth you need doesn’t reliably come back. Pleasure then becomes something postponed “until everything is okay,” which rarely arrives. A better approach is to treat pleasure as a legitimate requirement and schedule it explicitly—small, regular sources of enjoyment that don’t depend on others’ moods. When your own pleasure is met, care becomes sustainable rather than sacrificial, and it’s often received more positively too.",
        "Affiliation": "You may care partly to secure belonging—becoming indispensable so you won’t be excluded or forgotten. This can turn care into a strategy for safety rather than a natural expression of connection, and you may feel anxious when you’re not needed. The strain is conditional belonging: affiliation starts to feel like it depends on your usefulness. Over time, this can limit your freedom and make relationships feel subtly transactional, even if you have good intentions. A healthier balance is to practice affiliation directly through mutuality—sharing needs, asking for support, and letting others contribute. Belonging becomes stronger when care flows both ways, and you feel valued for who you are, not only for what you provide.",
        "Value": "You may spend a lot of energy maintaining intimate relationships out of duty—trying to prove you are good, responsible, or morally aligned. If your value system is demanding, care can become heavy, and setting limits may trigger guilt, as if boundaries mean you’re failing. The strain is chronic over-commitment and self-neglect framed as virtue, where “being good” quietly becomes exhausting. A healthier approach is to broaden what “goodness” means to include sustainability, rest, and honest limits. When you allow care to be wise rather than endless, it becomes a cleaner expression of your values—one that strengthens relationships instead of draining you."
      },
      "Affiliation": {
        "Exploration": "You may seek social connection as a gateway to innovation—feeling that relationships with people who carry novel ideas can offer inspiration, resources, or support for your own exploratory endeavors. If the group isn’t stimulating or you feel a bit insecure, exploration can slow down, and you may find yourself experimenting with different circles or activities in search of the right fit. The strain is that curiosity can start to depend on external validation and social energy. A healthier balance is to cultivate solo exploration alongside shared experiences. When exploration isn’t socially contingent, affiliation becomes a choice rather than a necessity.",
        "Achievement": "You may invest in belonging to a group to increase your chances of achievement, seeking resources, support, reassurance, approval, or encouragement. The strain is that social time can unintentionally replace the tasks that would actually resolve achievement dissatisfaction directly and more effectively. A balanced approach is to use affiliation as additional support for execution: reliable partners, collaborative goals, and structured encouragement. Belonging can aid achievement, but never replace it.",
        "Dominance": "You may try to secure belonging to fulfill the need for gaining control—feeling that belonging can facilitate control. This can create tension because affiliation requires mutual respect rather than dominance. The effort to make social connections often requires one to relinquish impulses of dominance. A healthier approach is to separate domains of affiliation and dominance, don’t mix the two social settings as one. You can have your circles of friends where it focuses on mutual support, and another setting where you focus on being the decision maker.",
        "Pleasure": "You may socialize for relief and enjoyment, hoping fun can compensate for lack of pleasure and relaxing experience. However if connection requires effort to maintain, it can feel straining rather than relaxing. A healthier approach is to combine social pleasure with connections: choose the right kind of social group that make you feel more relaxed and less about fitting in.",
        "Care": "You may seek closeness to ensure care—assuming proximity will naturally create support. If others are present but not responsive in the way you need, affiliation may not satisfy care needs and can start to feel painful. The strain becomes confusion and disappointment: “We’re connected, so why don’t I feel cared for?” A healthier strategy is to make care explicit: ask directly, negotiate support, and choose relationships with reciprocity. Affiliation becomes most meaningful when it reliably carries care.",
        "Value": "You may feel that being included is an important part of feeling worthiness—so belonging becomes a signal that you are “on the right side” rather than a chance to enjoy friendship and peer support. This can create strain: you fit in a group, but don't genuinely feel that you are in the “right kind of group” in your own value system. A healthier approach is to clarify your principles and choose communities that match them, or create room for pluralism within relationships. Belonging is strongest when it doesn’t require self-erasure."
      },
      "Value": {
        "Exploration": "You have a value system that suggests if you follow a chosen path, you can create the right conditions to explore—new ideas, experiences, or identities that feel personally alive. The strain often comes from the fact that external value systems tend to reward “approved” exploration (safe, credentialed, easy to explain), while your real exploratory needs can be more unique, nonlinear, and intrinsically motivated. You may do everything you’re supposed to do, yet still feel hesitant, because no system can fully grant the inner permission that genuine exploration requires. As a result, exploration can start to feel stalled or strangely empty: you complied, but you don’t feel truly free. A healthier balance is to treat exploration as an essential internal nutrient—protect time for curiosity (hobbies, research, travel, creative play) and let outside values be a helpful reference, not the gatekeeper. Then value supports exploration without turning it into a monitored performance.",
        "Achievement": "You have a value system that suggests if you follow a chosen path, you can achieve goals that the system recognizes and rewards. The strain often comes from pursuing goals that are socially prestigious but not personally aligned, or from realizing you did everything “right” yet the system still doesn’t acknowledge your achievement in the way you expected. As a consequence, it’s understandable to feel disillusioned and frustrated. A healthier balance is to define “valuable achievement” in terms of your internal compass—your genuine interest, competence, and environmental support—while letting outside values remain a point of reference rather than the final judge of success. Then value supports achievement without becoming a confining cage.",
        "Dominance": "You have a value system that suggests if you follow a chosen path, you can justify taking control—setting direction, enforcing standards, or correcting what feels wrong. The strain often comes from trying to translate broad moral ideals into constant intervention in real life: the world doesn’t always cooperate, people may resist, and outcomes remain imperfect. You may do everything you feel you should do—set rules, push, manage, “hold the line”—yet reality still won’t fully align, which can be deeply tiring. As a result, dominance can become tense and exhausting: it can feel like you’re responsible for maintaining order everywhere, and your nervous system doesn’t get to fully relax. A healthier balance is to narrow the scope of what you must control: focus on boundaries, selective arenas of influence, and consistent modeling rather than total enforcement. Then value supports dominance without turning you into a full-time moral police force.",
        "Pleasure": "You have a value system that suggests if you follow a chosen path, you can finally deserve pleasure—rest, comfort, enjoyment—without guilt. The strain often comes from external standards that treat pleasure as suspicious or secondary, so even when you “earn it,” your body may not fully let you receive it. You may do everything you’re supposed to do, yet pleasure still feels diluted, rushed, or quietly restricted, as if relaxation is never completely allowed. As a result, you may swing between deprivation and binge-like relief: pleasure becomes a pressure valve rather than true replenishment. A healthier balance is to redefine pleasure as part of responsible functioning—small, regular enjoyment that sustains energy and reduces rebellion cycles. Then value supports pleasure without turning it into a reward you can never quite claim.",
        "Care": "You have a value system such that it seems if you act according to the rules, it will bring you closer to your loved ones and family. The strain often comes from the fact that what you sincerely believe is “good care” may not match what they actually need in the moment. A balanced approach is to stay grounded in your values while also listening more directly to their real needs—supporting them in the ways that truly land for them, not only in the ways your value system says you should provide. This can make your care feel more effective and more warmly received. In this way you support them in ways that help, while also avoiding over-giving that quietly drains your energy.",
        "Affiliation": "You have a value system such that it seems if you act according to the rules, it will bring you closer to a community—earning belonging through being “the right kind” of person. The strain often comes from the fact that what you think strengthens connection (correctness, loyalty, proving alignment) may not always serve what relationships and groups truly need (warmth, honesty, shared humanity, flexibility). As a result, you may keep investing in being acceptable yet still feel emotionally outside—because people connect most to your real presence, not your compliance. A balanced approach is to listen for the group’s real relational needs (trust, reciprocity, humor, vulnerability) and to choose contexts where difference is tolerated rather than punished. In this way you support affiliation in ways that actually create closeness, while also reducing the pressure to over-adapt to “rightness” in a way that violates your core beliefs."
      }
    },
    "transferAdvice": {
      "Exploration": {
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as Exploration & Innovation in your outer personality. This means your curiosity and learning are not “just doing whatever you want”; they are connected to making progress toward goals. On the surface, it may look like you care more about exploring than executing, but your exploration is ultimately serving your drive to reach goals and gain achievement. When that goal-linked direction is missing, your exploration can become scattered or inefficient without you noticing. The advice is to keep a light output rhythm—combine exploration with one concrete action step, so exploration stays connected to moving your goals forward.",
        "Dominance": "Some of your inner Decision Leadership energy is redirected and shows up as Exploration & Innovation in your outer personality. This means exploring and learning are, in part, how you build leverage, increase agency, and feel in control. On the surface, it may look like you “just like ideas,” but the deeper function is to gain influence through getting leading insights. When exploration does not turn into decision power or real impact, you may feel subtly frustrated or limited. The advice is to clearly define your decision scope and boundaries, so your exploration can reliably turn into real agency.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as Exploration & Innovation in your outer personality. This means exploring and learning has become a way for you to relax and enjoy yourself, not just work. On the surface, it may look like you are chasing new knowledge, but your system is using curiosity to compensate for enjoyment and fun. When exploration shifts from nourishing play into restless effort, you can become more drained even while you are “doing interesting things.” The advice is to protect small, simple pockets of rest or fun, so exploration stays enjoyable instead of turning into a compulsive chase.",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as Exploration & Innovation in your outer personality. This means understanding and learning new things is one way you treat people better and protect close relationships more responsibly. On the surface, it may look like you prefer thinking over helping, but that thinking is often preparation for caring well. If you stay in rational analysis too long, you may feel you are only “caring in theory,” while the relationship still needs action. The advice is to turn insight into one stable caring behavior (check in, follow through, give reassurance), so care is expressed directly.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as Exploration & Innovation in your outer personality. This means learning and new knowledge are a path you use to build connection and a sense of group belonging. On the surface, relationships may seem to depend on whether you can keep producing new viewpoints, but the deeper function is creating social bonding through shared experiences. If “freshness” becomes a requirement for connection, belonging becomes fragile. The advice is to add some purely belonging-building activities (regular contact, recurring plans, shared commitments), so relationships do not depend on nonstop new ideas.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as Exploration & Innovation in your outer personality. This means exploration and curiosity feel meaningful because they serve your identity, integrity, or inner standards. On the surface, it may look like you are chasing ideas, but your exploration is usually anchored in “what is worth pursuing.” When you cannot explain its value, you may start doubting whether it is worth it, and your motivation drops. The advice is to clearly name the value of exploration itself (guiding, serving, renewing), so exploration stays an activity with its own enjoyment, instead of becoming self-doubt when you hit setbacks."
      },
      "Achievement": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means exploration and learning are being guided into execution, and learning becomes a way to produce results. On the surface, you may look very focused on outcomes, but your progress is often driven by interest. If your goals start to feel less novel or too restricted, your motivation may drop because the “oxygen” of exploration is missing. The advice is to keep a little time each week for exploration, so exploration continues to feed your pursuit of goal achievement instead of being squeezed out by goals.",
        "Dominance": "Some of your inner Decision Leadership energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means one reason you pursue achievement is to gain autonomy and control. On the surface, it may look like you simply want to perform better, but the deeper goal is often to prove your leadership through competence. If achievements keep piling up but do not bring you more decision power, you may feel subtly trapped or not valued. The advice is to clarify the decision scope you can lead, so your real results can translate into real control.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means one reason you pursue achievement is to help you feel better, more relaxed, or more satisfied. On the surface, you may look like you are always “on,” but underneath, this is often how you can finally relax. When striving becomes joyless, goal achievement becomes fragile and hard to sustain. The advice is to include entertainment and enjoyment in daily life (reserve some time to relax and enjoy), instead of only relaxing “after everything is done.”",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means one reason you pursue achievement is to give the people close to you stability and/or a sense of safety. On the surface, you may put achievement before family feelings, but your effort is also serving a protective function. If you start carrying everything alone, you will feel “responsible” while becoming exhausted. The advice is to share responsibility and show direct emotional support—not only protect relationships through achievement results. Let care be expressed through more than just doing tasks.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means one reason you pursue achievement is to maintain belonging, contribution, and group identity. On the surface, it may look like you are chasing goals, but the deeper function is “earning” acceptance through achievement. If group belonging starts to feel conditional on achievement, you may feel pressure even when you succeed. The advice is to invest some pure energy into relationships (shared time, mutual support, honest openness), so connection does not depend on achievement.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as a pursuit of Goal Achievement in your outer personality. This means you pursue achievement because you feel part of your self-worth depends on it. On the surface, it may look like you are chasing metrics, but your direction is often constrained by your values. If external measures squeeze out meaning, you may still feel an invisible “wrongness” even when you succeed. The advice is to reflect regularly: “Does this fit my values?” and adjust goals so achievement stays value-bound."
      },
      "Dominance": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. On the surface, you may value control more than open exploration, and this strategy partly compensates your curiosity. Deep down, the reason you seek control is to protect your need to explore and innovate. But when the desire to lead decisions becomes too strong, your exploration space shrinks and you may feel strangely restricted. The advice is to use small, low-risk experiments, so exploration can keep going without losing control.",
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. This means “taking charge” is a strategy to ensure progress, overcome obstacles, and keep moving toward goals. On the surface, control may look like the goal, but the deeper goal is efficiency and results. If decision power does not bring better output, the desire to control may drop. The advice is to shift from only strengthening control toward directly pushing goals forward, without needing to constantly increase control.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. This means control makes you feel more relaxed and safe. Getting control becomes a way to regulate stress. On the surface, you may always be in command mode, but underneath your system is looking for ease. If decision leadership never turns off, enjoyment becomes a “right you only get when you stay on top,” which is very exhausting. The advice is to schedule clearly non-competitive relaxation time, so enjoyment is available even when you are not controlling outcomes.",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. This means your drive for leadership and control has a protective side: you use leadership to make close emotional bonds feel safer and stronger. On the surface, control replaces warmth, but the deeper core is protection. When others need emotional support and reassurance more than guidance, you may feel upset because your care is not “landing.” The advice is to switch from “commanding” to “caring”: ask “How can I support you better?” and share control where possible, so care becomes mutual and two-way.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. This means you may seek belonging or status in groups by leading or increasing control. On the surface, it looks like you are chasing status, but deeper down you want people to accept you more. But power does not always bring real belonging, so you may still feel lonely even when you are “in charge.” The advice is to build some horizontal relationships—where you are just a person, not an authority—so belonging does not depend on rank.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as a pursuit of Decision Leadership in your outer personality. This means you partly tie your inner value to your leadership and decision ability, which increases your motivation in this area. On the surface, your desire to lead may seem stronger than personal beliefs, but your decisions still serve your inner values. When those value boundaries are crossed, you may sometimes feel unexplained discomfort or anger. The advice is to clearly understand your value boundaries, so decision making does not cross them."
      },
      "Pleasure": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means play and rest are compensating your need to explore. On the surface, it looks like you want to relax and enjoy, but deeper down it may be how you recharge to keep exploring. If surface-level enjoyment starts squeezing out exploration time, you may still feel unsatisfied even while “having fun.” The advice is to choose quieter relaxing activities, like walks or small hobbies, to restore your exploration energy.",
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means enjoyment is used as a compensation mechanism. On the surface, it looks like comfort-seeking, but it may be compensating your inner drive to achieve. If your progress toward goals stalls, enjoyment can slide from reward into avoidance. The advice is to give relaxation a small space, while pairing it with steady action, so your steps toward goal achievement stay stable.",
        "Dominance": "Some of your inner Decision Leadership energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means relaxation and fun help you regain groundedness and control. On the surface, it looks like you are relaxing, but your system may be rebuilding agency through rest. If you still feel directionless after relaxing, it is often because decision leadership needs you to “express choice.” The advice is to pair enjoyment with one decision-leadership action (a decision, a boundary, a plan), so responsibility and enjoyment can move together.",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means “relaxing and having fun” is how you cope with the need for mutual care in close relationships. On the surface, it looks like you prioritize enjoyment, but deeper down you may be protecting your emotional savings. If the relationship needs more than “good vibes,” you may feel pulled between enjoyment and responsibility. The advice is to keep enjoyment, but also allow yourself to express your need for care; and clearly show caring actions (check in, repair, follow through), so care is mutual and clearly communicated.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means social fun is a bonding mechanism—“having fun” is how closeness happens. On the surface, it looks like casual hangouts, but the deeper function is belonging. If you start craving deeper relationships, event-based fun can feel shallow. The advice is to reduce the number of people and increase stable contact, so enjoyment keeps building real connection instead of just passing time.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as Entertainment & Enjoyment in your outer personality. This means, in your values, enjoyment and pleasure feel justified. On the surface, it looks like you are playing, but it may also be maintaining your image of a good life. If guilt comes back, it is often because you lose the “permission” to enjoy life, and enjoyment no longer feels worthwhile. The advice is to frame relaxation and enjoyment as a legitimate basic need and detach it from other reasons; this supports your long-term integrity."
      },
      "Care": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as Intimate Protection actions in your outer personality. On the surface, you may spend a lot of energy protecting close relationships, but deeper down you are often learning people’s psychology and what they truly need. If the responsibility of being a protector squeezes out your exploration, you will be more easily drained and less able to offer creative support. The advice is to protect personal exploration time, so you stay mentally nourished while caring for others.",
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as protecting close relationships in your outer personality. This means support and responsibility in close relationships become, to some extent, one of your life goals. On the surface, you may put relationships before personal achievement, but your caring may also satisfy a kind of achievement feeling. If caring fully replaces your pursuit of personal achievement, you may feel quietly stuck while still being “busy.” The advice is to reserve time for concrete goals, so protecting relationships and personal achievement can both be ways of self-realization.",
        "Dominance": "Some of your inner decision-control energy is redirected and shows up as Intimate Protection in your outer personality. This means protecting close relationships becomes a way to compensate for your need for control and decisions. On the surface, you may spend more time protecting family or loved ones, but deeper down this can be how you gain control. If caring does not give you any sense of control or decision power, the relationship may start to feel out of control. The advice is to return to emotion-based care: ask what is needed, share responsibility, and let others have choices when possible.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as Intimate Protection in your outer personality. This means helping others feels rewarding and emotionally nourishing, not only duty. On the surface, you may always be available, but your driver can be the good feelings from helping. If you run low, care can become depleted while still feeling “necessary.” The advice is to schedule direct personal enjoyment so care stays generous instead of draining.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as Intimate Protection in your outer personality. This means caring for close relationships is one way you get belonging, and it also compensates your social needs. On the surface, you may focus on family or a partner and become distant from friends, but then you may ignore your need for friendship. The advice is to keep some space and energy for social needs with friends or colleagues, so caring for family or a partner does not block your friendship needs.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as Intimate Protection in your outer personality. This means responsibility and love become one condition for you to approve of yourself. You believe spending time and energy protecting loved ones is the “right” thing. On the surface, it looks like self-sacrifice, but deeper down you feel it matches your values. But if caring requires endless giving, you can feel tired under heavy moral pressure. The advice is to redefine “intimate protection” to include sustainability and boundaries, so care becomes something warm to hope for, not a pattern of self-punishment."
      },
      "Affiliation": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as pursuing Interpersonal Relationships in your outer personality. This means community activities are one channel for your curiosity. On the surface, it looks like you need group approval, but deeper down it compensates your need to explore. If your curiosity depends too much on the group, it weakens when others are not engaged. The advice is to keep chances to explore alone, so solo exploration can self-sustain while you still benefit from social connection.",
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as pursuing Interpersonal Relationships in your outer personality. This means good relationships become one channel for your achievement feeling. On the surface, it can look like socializing replaces achievement, but if relationships become a substitute for action, you will feel busy but lack achievement. The advice is to make relationships and achievement actions support each other, so social energy becomes an aid to reaching goals instead of replacing it.",
        "Dominance": "Some of your inner Decision Leadership energy is redirected and shows up as pursuing Interpersonal Relationships in your outer personality. This means you may seek compensation for control through relationships. On the surface, you may look “integrated” in the group, but deeper down you may want a sense of control. If you feel powerless in groups, relationships can feel frustrating or performative. The advice is to keep a mutual, reciprocal relationship space; and seek control in areas with clearer rules of authority, so the dominance drive has a suitable outlet.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as pursuing Interpersonal Relationships in your outer personality. This means doing activities with friends or coworkers is an important way you relax and recover. On the surface, you are just social, but deeper down you get relaxation through belonging. If relationships stop feeling easy, relaxation drops and socializing becomes tiring. The advice is to choose smaller, safer circles, so connection brings ease without requiring performance.",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as pursuing Interpersonal Relationships in your outer personality. This means interactions with friends or coworkers may be trying to compensate for your needs in close relationships. On the surface, it is just socializing, but inside you may feel it could bring chances to find the close bond you truly want. If you find this does not turn into real closeness, resentment can build quietly. The advice is to state your needs for closeness clearly—say what you need, instead of only hoping social contact will compensate.",
        "Value": "Some of your inner Moral Value energy is redirected and shows up as Interpersonal Relationships in your outer personality. This means you connect being accepted by the group with your self-worth. On the surface, fitting in makes you feel more confirmed, but deeper down you treat group belonging as proof of your value. When group norms make you uncomfortable, you may deny your self-worth because you fear being rejected, and feel inner tension. The advice is to not use group approval as the standard of your self-worth—let mutual support in relationships nourish you, instead of burning yourself out to gain group recognition."
      },
      "Value": {
        "Exploration": "Some of your inner Exploration & Innovation energy is redirected and shows up as insisting on Moral Values in your outer personality. On the surface, following rules or ideals may override exploration, but deeper down you want ideals to give your exploration a moral anchor. If value constraints become too tight, exploration loses space. The advice is to treat curiosity as basic nutrition—let values support exploration instead of policing it.",
        "Achievement": "Some of your inner Goal Achievement energy is redirected and shows up as pursuing Moral Values in your outer personality. On the surface, it can look like ideals without action, but achievement is often what powers your values. If you stay in ideals without execution, you feel guilty or stuck. The advice is to translate values into measurable goal commitments, so values are achieved in practice, not only held in your mind.",
        "Dominance": "Some of your inner Decision Leadership energy is redirected and shows up as pursuing Moral Values in your outer personality. On the surface, pursuing ideals may compensate your desire for leadership. But if you focus on ideals without getting any control, you may feel out of control. The advice is to place moral pursuits and control needs into suitable domains, so both your values and your wish for leadership can be met sustainably.",
        "Pleasure": "Some of your inner Entertainment & Enjoyment energy is redirected and shows up as pursuing Moral Values in your outer personality. On the surface, values may compensate your desire to relax. But if your value pursuit keeps denying rest as legitimate, you will feel tired. The advice is to reframe rest and enjoyment as necessary and responsible, so enjoyment does not need to be “earned” through suffering.",
        "Care": "Some of your inner Intimate Protection energy is redirected and shows up as pursuing Moral Values in your outer personality. On the surface, duty may compensate your need for closeness, but deeper down the desire for closeness cannot be fully replaced. If you focus too much on being “correct,” you may miss what is actually needed. The advice is to keep the values frame, but keep listening and adjusting with loved ones, so care is practical, not only principled.",
        "Affiliation": "Some of your inner Interpersonal Relationship energy is redirected and shows up as pursuing Moral Values in your outer personality. On the surface, sticking to ideals may compensate your desire for belonging. But deeper down you want reliable relationship bonds. If your principles start damaging sincere friendship and mutual support, you may feel trapped in overly ideological spaces. The advice is to prioritize groups centered on trust and reciprocity, so values support relationships instead of replacing them."
      }
    }
  }
}
